package com.mit.campus.rest.makeData;

public class ConstansForData {

    //民族信息
    public static final String[] mingzu = {"壮族", "回族", " 满族", "维吾尔族", "苗族", "彝族", "土家族", "藏族", "蒙古族", "侗族", "布依族",
            "瑶族", "白族", "朝鲜族", "哈尼族", " 黎族", "哈萨克族", "傣族", "畲族", "傈僳族", "东乡族", "仡佬族", "拉祜族", "佤族", "水族", "纳西族", "羌族",
            "土族", "仫佬族", "锡伯族", "柯尔克孜族", "景颇族", "达斡尔族", "撒拉族", "布朗族", "毛南族", "塔吉克族", "普米族", "阿昌族", "怒族", "鄂温克族", "京族",
            "基诺族", "德昂族", "保安族", "俄罗斯族", "裕固族", "乌孜别克族", "门巴族", "鄂伦春族", "独龙族", "赫哲族", "高山族", "珞巴族", "塔塔尔族"};

    //学院信息
    public static final String xueyuan = "经管学院,体教学院,管理学院,理学院,化学学院,生科学院,食品学院,"
            + "材料学院,环化学院,机电学院,建筑学院,信息学院";
    //专业、辅导员、监护人信息
    public static final String[] zhuanye = {
            "经济学|经济学|褚雨祺|蒋娟,国际经济与贸易|经济学|钱春萍|彭启芬,旅游管理|管理学|葛元珊|许媛",
            "教育学|教育学|苏瑾|郑明珠,体育教育|教育学|张静欣|王丽,应用心理学|理学|冯文静|吕夏雪",
            "管理科学|管理学|施涛|金娅,信息管理与信息系统|管理学|陈文倩|施巧丽,电子商务|管理学|郑瑞|冯琴",
            "数学与应用数学|理学|彭妍|华胜珍,信息与计算科学|理学|何彤|秦寻文,光电信息科学与工程|工学|邬紫霜|杨丹",
            "化学|理学|华苹|何啟倩,应用化学|理学|秦琴|吴瑞进",
            "生物科学|理学|张亦瑶|傅树平,生物技术|理学|蒋敏|金滢,水产养殖学|农学|吴春燕|孔迎春",
            "食品科学与工程|工学|施育彤|王春喜,食品质量与安全|工学|沈晶|魏显丽,生物工程|工学|施丽|尤晓磊",
            "材料科学与工程|工学|魏苑|许育彤,高分子材料与工程|工学|沈丽丽|陶玉凤,新能源材料与器件|工学|吴啟倩|魏梦",
            "过程装备与控制工程|工学|褚翡翠|杨安琪,化学工程与工艺|工学|张娅|吴昭东,安全工程|工学|赵永珍|褚盼夏",
            "机械设计制造及其自动化|工学|韩静|王倩,材料成型及控制工程|工学|陶之念|陈媛,能源与动力工程|工学|沈冬儿|苏红燕",
            "土木工程|工学|张碧香|金婷,建筑学|工学|周锦|郑光兰,工程管理|管理学|许祖香|华采绿",
            "测控技术与仪器|工学|魏滢|李粤,计算机科学与技术|工学|何光兰|李亚萍,物联网工程|工学|朱半芹|范亚萍,数字媒体技术|工学|曹程悦|张雪",
    };
    //年级信息
    public static final String nianji = "2010,2011,2012,2013,2014,2015,2016,2017,2018";

    //姓氏
    public static final String xing = "赵,钱,孙,李,周,吴,郑,王,冯,陈,楮,卫,蒋,沈,韩,杨,朱,"
            + "秦,许,何,吕,施,张,孔,曹,严,华,金,魏,陶,姜,戚,谢,邹,喻,柏,水,窦,章,云,苏,潘,葛,"
            + "范,彭,郎,鲁,韦,昌,马,苗,凤,花,方,俞,任,袁,柳,鲍,史,唐,费,廉,薛,雷,贺,倪,汤,"
            + "罗,毕,常,乐,于,时,傅,皮,卞,齐,康,伍,余,元,卜,顾,孟,平,黄,和,穆,萧,尹,姚,邵,湛,汪,"
            + "宋,茅,庞,熊,纪,舒,屈,项,祝,董,梁,杜,阮,蓝,闽,席,季,"
            + "麻,强,贾,娄,危,江,童,颜,郭,梅,盛,林,徐,丘,高,夏,蔡,田,樊,胡,凌,霍,虞,万,柯"
            + ",丁,宣,邓,郁,单,杭,洪,包,诸,左,石,崔,吉,钮,龚,程,"
            + "裴,陆,荣,翁,"
            + "刘,詹,龙,叶,"
            + "司马,上官,欧阳,夏侯,诸葛,东方";

    //名
    public static final String ming = "天,地,玄,黄,宇,宙,洪,荒,日,月,盈,昃,辰,宿,列,张,寒,来,暑,往,秋,收,冬,藏,"
            + "闰,余,成,岁,律,吕,调,阳,云,腾,致,雨,露,结,为,霜,金,生,丽,水,玉,出,昆,冈,剑,号,巨,阙,珠,称,夜,光,果,珍,"
            + "重,海,咸,河,淡,鳞,潜,羽,翔,龙,师,火,帝,官,人,始,制,文,字,乃,服,衣,裳,推,位,让,国,"
            + "有,虞,陶,唐,吊,民,伐,罪,周,发,殷,汤,坐,朝,问,道,垂,拱,平,章,爱,育,黎,首,臣,伏,戎,羌,遐,迩,一,体,率,宾,"
            + "归,王,鸣,凤,在,竹,白,驹,食,场,化,被,草,木,赖,及,万,方,盖,此,身,发,四,大,五,常,恭,惟,鞠,养,岂,敢,毁,伤,"
            + "女,慕,贞,洁,男,效,才,良,知,过,必,改,得,能,莫,忘,罔,谈,彼,短,靡,恃,己,长,信,使,可,覆,器,欲,难,量,墨,悲,"
            + "丝,染,诗,赞,羔,羊,景,行,维,贤,克,念,作,圣,德,建,名,立,形,端,表,正,空,谷,传,声,虚,堂,习,听,祸,因,恶,积,"
            + "福,缘,善,庆,尺,璧,非,宝,寸,阴,是,竞,资,父,事,君,曰,严,与,敬,孝,当,竭,力,忠,则,尽,命,临,深,履,薄,夙,兴,"
            + "温,凊,似,兰,斯,馨,如,松,之,盛,川,流,不,息,渊,澄,取,映,容,止,若,思,言,辞,安,定,笃,初,诚,美,慎,终,宜,令,"
            + "荣,业,所,基,籍,甚,无,竟,学,优,登,仕,摄,职,从,政,存,以,甘,棠,去,而,益,咏,乐,殊,贵,贱,礼,别,尊,卑,上,和,"
            + "下,睦,夫,唱,妇,随,外,受,傅,训,入,奉,仪,诸,犹,子,比,儿";

    //电话号码前三位
    public static final String phonenumpre = "130,131,132,155,156,186,185,176,134,135,136,137,138,139,"
            + "150,151,152,157,158,159,182,183,184,188,187,147,178,133,153,180,181,189,177";
    //毕业去向地区
    public static final String[] biyequdiqu = {"华东地区", "华南地区", "华中地区", "华北地区", "西北地区", "西南地区", "东北地区", "港澳台地区"};
    //毕业去向市
    public static final String[] biyequdiquxiangshi = {"山东省济南市,山东省青岛市,山东省淄博市,山东省枣庄市,山东省东营市,山东省烟台市,山东省潍坊市,"
            + "山东省济宁市,山东省威海市,山东省日照市,山东省莱芜市,山东省临沂市,山东省德州市,山东省聊城市,山东省滨州市,山东省菏泽市,江苏省南京市,江苏省无锡市,江苏省徐州市,"
            + "江苏省常州市,江苏省苏州市,江苏省南通市,江苏省连云港市,江苏省淮安市,江苏省盐城市,江苏省扬州市,江苏省镇江市,江苏省泰州市,安徽省合肥市,安徽省芜湖市,安徽省蚌埠市,"
            + "安徽省淮南市,安徽省马鞍山市,安徽省淮北市,安徽省铜陵市,安徽省安庆市,安徽省黄山市,安徽省滁州市,安徽省阜阳市,安徽省宿州市,安徽省巢湖市,安徽省六安市,安徽省亳州市,"
            + "安徽省池州市,安徽省宣城市,浙江省杭州市,浙江省宁波市,浙江省温州市,浙江省嘉兴市,浙江省湖州市,浙江省绍兴市,浙江省金华市,浙江省衢州市,浙江省舟山市,浙江省台州市,"
            + "浙江省丽水市,福建省福州市,福建省厦门市,福建省莆田市,福建省三明市,福建省泉州市,福建省漳州市,福建省南平市,福建省龙岩市,上海市", "广东省广州市,广东省深圳市,广东省珠海市,"
            + "广东省汕头市,广东省韶关市,广东省佛山市,广东省江门市,广东省湛江市,广东省茂名市,广东省肇庆市,广东省惠州市,广东省梅州市,广东省汕尾市,广东省河源市,广东省阳江市,"
            + "广东省清远市,广东省东莞市,广东省中山市,广东省潮州市,广东省揭阳市,广东省云浮市,广西壮族自治区南宁市,广西壮族自治区柳州市,广西壮族自治区桂林市,"
            + "广西壮族自治区梧州市,广西壮族自治区北海市,广西壮族自治区防城港市,广西壮族自治区钦州市,广西壮族自治区贵港市,广西壮族自治区玉林市,广西壮族自治区百色市,"
            + "广西壮族自治区贺州市,广西壮族自治区河池市,广西壮族自治区来宾市,广西壮族自治区崇左市,海南省海口市,海南省三亚市,海南省五指山市,海南省琼海市,海南省儋州市,"
            + "海南省文昌市,海南省万宁市,海南省东方市,海南省澄迈县,海南省定安县,海南省屯昌县,海南省临高县,海南省白沙黎族自治县,海南省昌江黎族自治县,海南省乐东黎族自治县,"
            + "海南省陵水黎族自治县,海南省保亭黎族苗族自治县,海南省琼中黎族苗族自治县", "湖北省武汉市,湖北省黄石市,湖北省十堰市,湖北省荆州市,湖北省宜昌市,湖北省襄樊市,"
            + "湖北省鄂州市,湖北省荆门市,湖北省孝感市,湖北省黄冈市,湖北省咸宁市,湖北省随州市,湖北省仙桃市,湖北省天门市,湖北省潜江市,湖北省神农架林区,湖北省恩施土家族苗族自治州,"
            + "江西省南昌市,江西省景德镇市,江西省萍乡市,江西省九江市,江西省新余市,江西省鹰潭市,江西省赣州市,江西省吉安市,江西省宜春市,江西省抚州市,江西省上饶市,河南省郑州市,河南省开封市,"
            + "河南省洛阳市,河南省平顶山市,河南省安阳市,河南省鹤壁市,河南省新乡市,河南省焦作市,河南省濮阳市,河南省许昌市,河南省漯河市,河南省三门峡市,河南省南阳市,河南省商丘市,"
            + "河南省信阳市,河南省周口市,河南省驻马店市,河南省济源市,湖南省长沙市,湖南省株洲市,湖南省湘潭市,湖南省衡阳市,湖南省邵阳市,湖南省岳阳市,湖南省常德市,湖南省张家界市,"
            + "湖南省益阳市,湖南省郴州市,湖南省永州市,湖南省怀化市,湖南省娄底市,湖南省湘西土家族苗族自治州", "北京市北京市,天津市天津市,河北省石家庄市,河北省唐山市,河北省秦皇岛市,"
            + "河北省邯郸市,河北省邢台市,河北省保定市,河北省张家口市,河北省承德市,河北省沧州市,河北省廊坊市,河北省衡水市,山西省太原市,山西省大同市,山西省阳泉市,山西省长治市,"
            + "山西省晋城市,山西省朔州市,山西省晋中市,山西省运城市,山西省忻州市,山西省临汾市,山西省吕梁市,内蒙古自治区呼和浩特市,内蒙古自治区包头市,内蒙古自治区乌海市,内蒙古自治区赤峰市,"
            + "内蒙古自治区通辽市,内蒙古自治区鄂尔多斯市,内蒙古自治区呼伦贝尔市,内蒙古自治区巴彦淖尔市,内蒙古自治区乌兰察布市,内蒙古自治区锡林郭勒盟,内蒙古自治区兴安盟,"
            + "内蒙古自治区阿拉善盟", "宁夏回族自治区银川市,宁夏回族自治区石嘴山市,宁夏回族自治区吴忠市,宁夏回族自治区固原市,宁夏回族自治区中卫市,新疆维吾尔自治区乌鲁木齐市,"
            + "新疆维吾尔自治区克拉玛依市,新疆维吾尔自治区石河子市,新疆维吾尔自治区阿拉尔市,新疆维吾尔自治区图木舒克市,新疆维吾尔自治区五家渠市,新疆维吾尔自治区吐鲁番市,"
            + "新疆维吾尔自治区阿克苏市,新疆维吾尔自治区喀什市,新疆维吾尔自治区哈密市,新疆维吾尔自治区和田市,新疆维吾尔自治区阿图什市,新疆维吾尔自治区库尔勒市,新疆维吾尔自治区昌吉市,"
            + "新疆维吾尔自治区阜康市,新疆维吾尔自治区米泉市,新疆维吾尔自治区博乐市,新疆维吾尔自治区伊宁市,新疆维吾尔自治区奎屯市,新疆维吾尔自治区塔城市,新疆维吾尔自治区乌苏市,"
            + "新疆维吾尔自治区阿勒泰市,青海省西宁市,青海省海东地区,青海省海北藏族自治州,青海省黄南藏族自治州,青海省海南藏族自治州,青海省果洛藏族自治州,青海省玉树藏族自治州,"
            + "青海省海西蒙古族藏族自治州,陕西省西安市,陕西省铜川市,陕西省宝鸡市,陕西省咸阳市,陕西省渭南市,陕西省延安市,陕西省汉中市,陕西省榆林市,陕西省安康市,陕西省商洛市,甘肃省兰州市,"
            + "甘肃省金昌市,甘肃省白银市,甘肃省天水市,甘肃省嘉峪关市,甘肃省武威市,甘肃省张掖市,甘肃省平凉市,甘肃省酒泉市,甘肃省庆阳市,甘肃省定西市,甘肃省陇南市,甘肃省临夏回族自治州,"
            + "甘肃省甘南藏族自治州", "四川省成都市,四川省自贡市,四川省攀枝花市,四川省泸州市,四川省德阳市,四川省绵阳市,四川省广元市,四川省遂宁市,四川省内江市,四川省乐山市,四川省南充市,"
            + "四川省眉山市,四川省宜宾市,四川省广安市,四川省达州市,四川省雅安市,四川省巴中市,四川省资阳市,四川省阿坝藏族羌族自治州,四川省甘孜藏族自治州,四川省凉山彝族自治州,贵州省贵阳市,"
            + "贵州省六盘水市,贵州省遵义市,贵州省安顺市,贵州省铜仁地区,贵州省毕节地区,贵州省黔西南布依族苗族自治州,贵州省黔东南苗族侗族自治州,贵州省黔南布依族苗族自治州,云南省昆明市,云南省曲靖市,"
            + "云南省玉溪市,云南省保山市,云南省昭通市,云南省丽江市,云南省思茅市,云南省临沧市,云南省文山壮族苗族自治州,云南省红河哈尼族彝族自治州,云南省西双版纳傣族自治州,云南省楚雄彝族自治州,"
            + "云南省大理白族自治州,云南省德宏傣族景颇族自治州,云南省怒江傈傈族自治州,云南省迪庆藏族自治州,西藏自治区拉萨市,西藏自治区那曲地区,西藏自治区昌都地区,西藏自治区山南地区,西藏自治区日喀则地区,"
            + "西藏自治区阿里地区,西藏自治区林芝地区,重庆市", "黑龙江省哈尔滨市,黑龙江省齐齐哈尔市,黑龙江省鹤岗市,黑龙江省双鸭山市,黑龙江省鸡西市,黑龙江省大庆市,黑龙江省伊春市,黑龙江省牡丹江市,"
            + "黑龙江省佳木斯市,黑龙江省七台河市,黑龙江省黑河市,黑龙江省绥化市,黑龙江省大兴安岭地区,辽宁省沈阳市,辽宁省大连市,辽宁省鞍山市,辽宁省抚顺市,辽宁省本溪市,辽宁省丹东市,辽宁省锦州市,"
            + "辽宁省营口市,辽宁省阜新市,辽宁省辽阳市,辽宁省盘锦市,辽宁省铁岭市,辽宁省朝阳市,辽宁省葫芦岛市,吉林省长春市,吉林省吉林市,吉林省四平市,吉林省辽源市,吉林省通化市,吉林省白山市,吉林省松原市,"
            + "吉林省白城市,吉林省延边朝鲜族自治州", "澳门特别行政区澳门特别行政区,香港特别行政区香港特别行政区"

    };

    //************************POS数据**************************//
    public static final String xiaofeidian = "一食堂,二食堂,三食堂,清真食堂,风味食堂,食堂小卖部,宿舍小卖部,超市,KTV房,电影院,开水房,澡堂,图书馆";


    //************************失联预警数据**************************//
    //public static final String shiliandian="一食堂,二食堂,三食堂,图书馆,主教楼,人文楼,实验楼,行政楼,宿舍1,宿舍2,宿舍3,宿舍4";
    public static final String place = "A1实训教学楼,A2实训教学楼,A3信息楼,A4实训楼,A5实训楼,B1学生宿舍,B2学生宿舍,B3学生宿舍,C1食堂,C3民族食堂,D1图书综合楼,E1风雨操场,体育运动场";
    public static final String coordinate = "673.069091796875,-241.0374755859375|399.19091796875,-452.01568603515625|630.6162719726562,-380.9796142578125|446.67633056640625,-1095.7741088867188|378.61590576171875,-1030.6864013671875|902.8659057617188,-323.54241943359375|1100.2269287109375,-463.42529296875|955.5906982421875,-755.0426025390625|1028.4801025390625,-606.096923828125|939.1115112304688,-815.52880859375|890.9301147460938,-492.33642578125|890.9301147460938,-792.33642578125|763.6425170898438,-857.4633178710938";
    public static final String yyMM = "2017-01,2017-02,2017-03,2017-08,2017-09,2017-10,2017-11,2017-12,2018-01,2018-02";
    public static final String placetype = "学生失联区,学生活跃区";
    public static final String shilstatus = "失联中,已找到,正在调查";

    //************************一些常量**************************//
    //性别，2个
    public static String[] sex = {"女", "男"};

    public static String[] nation = {"汉族", "少数民族"};

    public static String[] accountType = {"农业", "非农"};

    public static String[] grade = {"优", "良", "中", "差"};

    public static String[] area = {"华中", "华东", "华南", "华北", "西北", "西南", "东北", "港澳台"};
    //12类专业
    public static String[] major = {"哲学", "历史学", "管理学", "文学", "艺术学", "工学", "法学", "经济学", "教育学", "理学", "农学", "医学"};
    //分析的属性集合
    public static String[] props = {"sex", "accountType", "nation", "grade", "area"};
    //省份（省级行政区）集合，34个
    public static String[] provs = {"江苏", "安徽", "山东", "浙江", "福建", "上海", "广东", "广西", "海南",
            "湖北", "江西", "河南", "湖南", "北京", "天津", "河北", "山西", "内蒙古", "宁夏", "新疆", "青海", "陕西",
            "甘肃", "四川", "云南", "贵州", "重庆", "西藏", "黑龙江", "辽宁", "吉林", "香港", "澳门", "台湾"};
    //地区，8个
    public static String[] areas = {"华东", "华南", "华中", "华北", "西北", "西南", "东北", "港澳台"};

    //部门常量
    public static String[] departmentarrys = {"学生工作处", "招生办公室", "教务处", "年级办公室", "学生科", "武装部保卫处", "团委办公室", "党委办公室", "后勤部"};
    public static String[] positionarrys = {"辅导员", "教导主任", "德育主任", "德育书记", "团委书记", "各年级组长", "学科组长", "宿舍管理", "清洁员", "打印员", "保结员", "保安"};



}


